{
  "basics": {
    "name": "LaDell Erby",
    "label": "QA Engineer at MINDBODY, Inc.",
    "image": "",
    "email": "ladellerby@gmail.com",
    "phone": "(209) 914-3898",
    "url": "https://ladellerby.com",
    "summary": "For the last 10+ years I have explored various technical positions in the SaaS industry from the Customer Service and Product Development departments. In my current role as a Software Quality Assurance Engineer, I am responsible for testing, calibrating, troubleshooting and debugging a range of software products from various tech stacks. Across these responsibilities I have surveyed, tested, advocated for, supported, and created various third-party and in house testing and CI/CD pipeline tools (i.e. automated testing frameworks, code coverage analysis etc.) to bring visibility to product quality throughout the organization. I enjoy improving my skills accross the stack and adding to the potential value I can provide to solve difficult challenges.",
    "location": {
      "countryCode": "US",
      "address": "San Luis Obispo, California"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "ladellerbyjr",
        "url": "https://www.linkedin.com/in/ladellerbyjr/"
      },
      {
        "network": "Instagram",
        "username": "ladellerby",
        "url": "https://instagram.com/ladellerby"
      },
      {
        "network": "MixCloud",
        "username": "ladellerby",
        "url": "https://www.mixcloud.com/ladell-erby/"
      }
    ]
  },
  "work": [
    {
      "name": "MINDBODY, Inc.",
      "position": "QA Engineer",
      "startDate": "2018-01-31",
      "highlights": [],
      "summary": "As a Software Quality Assurance Engineer, I am responsible for testing, calibrating, troubleshooting and debugging a range of software products from various tech stacks. Across these responsibilities I have surveyed, tested, advocated for, supported, and created various third-party and in house testing and CI/CD pipeline tools (i.e. automated testing frameworks, code coverage analysis etc.) to bring visibility to product quality throughout the organization.",
      "url": "https://www.linkedin.com/company/42640"
    },
    {
      "name": "Epic Entertainment",
      "position": "DJ & MC",
      "startDate": "2017-02-28",
      "highlights": [],
      "summary": "As a Mobile DJ, I take care of many key responsibilities that allow events to flow seamlessly and create a memorable experience for all involved. This includes an extensive amount of planning of the event prior via consulation with the client and other service industry professionals as well as day of tasks. I am experienced in setting up, operating, and monitoring a variety of amplified sound systems and configurations to fit client needs. I also have extensive MC experience and the ability to guide the night via my voice and other audio cues.  ",
      "url": "https://www.linkedin.com/company/7298649"
    },
    {
      "name": "Epic Entertainment",
      "position": "Photobooth Host",
      "startDate": "2015-08-31",
      "endDate": "2017-02-28",
      "highlights": [],
      "summary": "",
      "url": "https://www.linkedin.com/company/7298649"
    },
    {
      "name": "MINDBODY, Inc.",
      "position": "QA Technician",
      "startDate": "2015-10-31",
      "endDate": "2017-12-31",
      "highlights": [],
      "summary": "As a Software Test Technician, I come in each day with a mission- break code through testing. I work in an Agile Scrum development environment with a close-knit scrum team and I am in  constant communication with the developers, other testers, and designers dicussing newly created features. MINDBODY SaaS software provides a fun and constantly growing platform for me to always be working on something different and new as I grow in the company.",
      "url": "https://www.linkedin.com/company/42640"
    },
    {
      "name": "MINDBODY, Inc.",
      "position": "API Support Specialist",
      "startDate": "2013-04-01",
      "endDate": "2015-10-02",
      "highlights": [],
      "summary": "Supported and provided technical consultation for third party developers integration utilizing public facing MINDBODY API's.",
      "url": "https://www.linkedin.com/company/42640"
    },
    {
      "name": "MINDBODY, Inc.",
      "position": "Technical Support Specialist",
      "startDate": "2009-10-02",
      "endDate": "2013-04-01",
      "highlights": [],
      "summary": "Provided technical support and training to clients using the MINDBODY software.",
      "url": "https://www.linkedin.com/company/42640"
    },
    {
      "name": "San Luis Obispo Regional Transit Authority",
      "position": "Marketing and Community Relations Intern",
      "startDate": "2011-01-31",
      "endDate": "2011-04-30",
      "highlights": [],
      "summary": "Conducted research and contacted city officials to guide capital investment improvements to the San Luis Obispo Regional Transportation Authority existing bus line infrastructure.",
      "url": "https://www.linkedin.com/company/564168"
    },
    {
      "name": "California Department of Transportation",
      "position": "Transportation Planning Intern",
      "startDate": "2009-01-31",
      "endDate": "2010-06-30",
      "highlights": [],
      "summary": "Used traffic counts, car volumes, Excel, Arc GIS, and Trans CAD to create maps, graphs, and reports to display future car counts and volumes to determine the Level of Service for all State Highways in Santa Barbara, San Luis Obispo, Monterey, Santa Cruz, and San Benito Counties. \n\nAlso aided in the creation of Transportation Planning Reports: comprehensive summary document that captures physical, social, political, and development characteristics along State Routes, and Corridor System Management Plans: document that provides for the integrated management of travel modes and roadways so as to facilitate the efficient and effective mobility of people and goods within California's most congested transportation corridors. Each CSMP presents an analysis of existing and future traffic conditions and proposes traffic management strategies and transportation improvements to maintain and enhance mobility. CSMP's will address State Highways, local roadways, transit, and other transportation modes.",
      "url": "https://www.linkedin.com/company/2661"
    },
    {
      "name": "Cal Poly State University",
      "position": "Student Assistant",
      "startDate": "2008-09-30",
      "endDate": "2009-04-30",
      "highlights": [],
      "summary": "Created and modified documents using Microsoft Office and Adobe CS3 Suites. Maintained and operated fax/ copy/ scan machines. Light janitorial duties. \n\nScheduled appointments for students with their counselors. Administered academic skill seminars for students in topics such as Time Management, Studying, and Note Taking.",
      "url": "https://www.linkedin.com/company/9118"
    },
    {
      "name": "Cal Poly State University",
      "position": "Learning Assistant",
      "startDate": "2008-06-30",
      "endDate": "2008-09-30",
      "highlights": [],
      "summary": "Led a supplemental Psychology class for incoming college freshmen and introduced them to college life to allow for a smooth transtion into higher education.",
      "url": "https://www.linkedin.com/company/9118"
    }
  ],
  "volunteer": [
    {
      "organization": "Jack's Helping Hand",
      "position": "Volunteer",
      "startDate": "2011-07-09",
      "summary": "This organization enables and empowers families and the community, to meet the unique and unmet physical, mental and medical needs of children and young adults under the age of 21.\n\nThey are there to help when a child is diagnosed with cancer, injured, or is stricken with a rare condition or disability. In San Luis Obispo County, parents or guardians of children with special needs can turn to Jack's Helping Hand, a local nonprofit, for assistance with travel expenses, lodging, food, therapeutic and specialized equipment, and other needs that are not available from other sources, or that exceed the family's financial capability.",
      "highlights": [],
      "url": "https://www.jackshelpinghand.org/"
    }
  ],
  "education": [
    {
      "institution": "California Polytechnic State University-San Luis Obispo",
      "area": "City and Regional Planning, Transportation Planning Emphasis",
      "studyType": "",
      "startDate": "2006-12-31",
      "endDate": "2012-12-31"
    },
    {
      "institution": "Cuesta College",
      "area": "Real Estate",
      "studyType": "",
      "startDate": "2009-12-31",
      "endDate": "2009-12-31",
      "gpa": "",
      "courses": [
        "null - Real Estate Economics",
        "null - Real Estate Law"
      ]
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Automated Testing",
      "level": "5",
      "keywords": ["JavaScript", "C#", "Front-End", "Back-End", "api-testing", "ui-testing", "XUnit", "Selenium", "Cypress", "Jest"],
      "description" : "I am proficient in creating, implementing, and managing automated test suites for enterprise grade web applications. I can provide full automated test frameworks from test case creation to CI/CD integration and any where in between. "
    },
    {
      "name": "React",
      "level": "2",
      "keywords": ["Next.js", "Gatsby.js", "Chakra-Ui", "Tailwind-CSS", "Server-Side-Rendering", "Server-Side-Generation"],
      "description" : "React is my front end library of choice. I have created full stack web applications using React with features such as Headless CMS integration, User Authentication, Session Management, and Form Submissions etc. "
    },
    {
      "name": "WordPress",
      "level": "6",
      "keywords": ["Managed WordPress Hosting", "Theme Customization", "Wordpress Migrations", "Wordpress Redesigns", "WooCommerce", "Google Analytics + SEO", "Responsive Design"],
      "description" : "I have end to end project experience with the WordPress platform. I can launch a project from idea/requirements to a fully functioning production ready web site. I have extensive experience with managing existing WordPress projects via theme and plugin modifications, SEO and Analytics monitoring, and Web Hosting setups. "
    }
  ],
  "languages": [
    {
      "language": "en",
      "fluency": "Native Speaker"
    }
  ],
  "interests": [],
  "references": [
    {
      "name": "Maria Arvizu-Rodriguez",
      "reference": "LaDell served as a Learning Assistant and I had the pleasure to supervise his work. His dedication and team skills were invaluable to the success of our program. LaDell is easy to work with and was well liked and supported by co-workers and the students/clients he served. LaDell is responsible, punctual and has strong organizational skills. I would highly recommend LaDell for any position. "
    },
    {
      "name": "Maria Arvizu-Rodriguez",
      "reference": "LaDell is a courageous, bright and caring professional. He is dedicated and upholds strong ethics. He is easy going and brings a sense of vision and confidence to any team. I highly recommend him as he will be an asset to any organization."
    },
    {
      "name": "Ryan Stollmeyer",
      "reference": "LaDell is a very strong part of our Customer Service team at MINDBODY.  Not only is he a product expert for the MINDBODY software, leading over 600 software trainings in his tenure, his customer service and organizational skills are also excellent.  I highly recommend LaDell for any organization."
    },
    {
      "name": "Adam Fukushima, PTP",
      "reference": "LaDell laid the groundwork for our State Route 1 Corridor System Management Plan while an intern at Caltrans. LaDell is a hard worker, easy going and a pleasure to work with!"
    }
  ],
  "projects": [
    {
      "name": "LaDell Erby Portfolio",
      "description": "Next.js app built to house my portfolio. This app will return Contact Info, Resume Widgets, Downloadable Resume, and.... EasterEggs!",
      "highlights":[
        "test"
      ],
      "keywords":[
        "test"
      ],
      "startDate": "2020-01-01",
      "url": "https://github.com/ladellerby/me",
      "website": "https://ladellerby.com",
      "image" : "https://api.ladellerby.com/wp-content/uploads/2021/03/ladell-erby-portfolio-site.png"

    },
    {
      "name": "Hour Rangers Dashboard",
      "description": "Team dashboard and widgets for the Hour Rangers engineering team. Testing React features while having just a LITTLE bit of fun lol.",
      "highlights":[
        "test"
      ],
      "keywords":[
        "test"
      ],
      "startDate": "2020-01-01",
      "url": "https://github.com/ladellerby/hour-rangers",
      "website": "https://hour-rangers.xyz",
      "image" : "https://api.ladellerby.com/wp-content/uploads/2021/03/hour-rangers-dashboard-site.png"
    }
  ]
}
